<a href="https://colab.research.google.com/github/Konoko2004/TheProject/blob/main/Pandas%20Test.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
print("This is a test")

In [7]:
import pandas as pd
import numpy as np

In [53]:

#using pandas OrderedDict , we need to import OrderedDict first.

from collections import OrderedDict

Ordered_Dict = pd.DataFrame(OrderedDict([
  ("Name",["Winston","Byrion","William"]),
  ("Occupation",["Data Guy","Developer","Jobless"]),
  ("Age",[34,25,18])
  ]))

UnOrdered_Dict = pd.DataFrame(
    {'Name':['Rosaline','William','Kappanator'],
     'Age':[19,33,69],
     'Occupation': ['Chemist','Tech Guy','Memer'],
     },
     index = ["A","B","C"],
     columns = ['Name','Age','Occupation']
)


UnOrdered_Dict

         Name  Age Occupation
A    Rosaline   19    Chemist
B     William   33   Tech Guy
C  Kappanator   69      Memer

In [55]:
#1 trick with bool Values returning index of a table
#using UnOrdered_Dict Table

#this will return index 0 and index 2. Note that the length of values in manual_bool_Values has to match the number of rows in UnOrdered_Dict
Manual_bool_values = [True,False,True]

UnOrdered_Dict[Manual_bool_values]

         Name  Age Occupation
A    Rosaline   19    Chemist
C  Kappanator   69      Memer

In [5]:

s = pd.Series(['Winston',32],
              index = ['Person',"age"])

In [13]:
nparray = np.array(["Kappa","Keepo"])
testing = pd.Series(nparray,
                    index = ['Meme1','Meme2'])

testing

Meme1    Kappa
Meme2    Keepo
dtype: object

In [23]:
import yfinance as yf
import pandas as pd

In [31]:
nio = yf.Ticker("NIO")
nio.history(period = "1y")
nio_data = nio.history(period = "1y")

#create high - low column
nio_data = pd.DataFrame(nio_data)
nio_data['Open/Close Diff'] = abs(nio_data['Open'] - nio_data['Close'])
#Return mean of Open/Close Diff
nio_mean = nio_data['Open/Close Diff'].mean()
#Return Rows where Open/Close Diff is greater than mean
nio_data[nio_data['Open/Close Diff'] > nio_mean]

                 Open       High  ...  Stock Splits  Open/Close Diff
Date                              ...
2020-07-07  11.260000  13.770000  ...             0         1.960000
2020-07-13  15.260000  16.440001  ...             0         1.420000
2020-07-20  11.420000  12.840000  ...             0         1.400000
2020-08-11  15.300000  15.450000  ...             0         2.310000
2020-08-25  15.080000  17.870001  ...             0         2.760000
...               ...        ...  ...           ...              ...
2021-04-30  37.730000  41.220001  ...             0         2.110001
2021-05-10  36.779999  36.790001  ...             0         2.449997
2021-05-11  32.450001  35.459999  ...             0         2.419998
2021-05-13  33.849998  34.270000  ...             0         2.629999
2021-05-14  31.940001  33.689999  ...             0         1.479998

[87 rows x 8 columns]